       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMMENT.
       AUTHOR. STELEE.
       
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
      * this is a comment
      * you are going to display a message
           DISPLAY "Hello, World!".
           STOP RUN.
