       IDENTIFICATION DIVISION.
       PROGRAM-ID. JACK.
       AUTHOR. STELEE.
       
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  THE-MESSAGE PIC X(20).
       01  LINE-NUMBER PIC 9(2).
       01  THE-SPACE PIC X(1) VALUE SPACE.
       
       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           MOVE 0 TO LINE-NUMBER.

           MOVE "JACK AND JILL" TO THE-MESSAGE.
           PERFORM DISPLAY-MESSAGE-LINE.
          
           MOVE "WENT UP THE HILL" TO THE-MESSAGE.
           PERFORM DISPLAY-MESSAGE-LINE.
           
           MOVE "TO FETCH A POUND OF FEE" TO THE-MESSAGE.
           PERFORM DISPLAY-MESSAGE-LINE.
           
       PROGRAM-DONE.
           STOP RUN.
       
       DISPLAY-MESSAGE-LINE.
           ADD 1 TO LINE-NUMBER.
           DISPLAY LINE-NUMBER THE-SPACE THE-MESSAGE.
